src/InformationRegisters/Профосмотры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Профосмотры</Name>
			<Comment>Хранит историю проведения и планирования профосмотров</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапланированная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПрофосмотров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредварительнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправившийВрач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаНаправления</Name>
					<Comment>Причина направления к врачу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПереноса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОсмотров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыОсмотров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОсмотров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Направление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОчередьНаЗапись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Профосмотр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторныйПрием</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыПрофосмотров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыПрофосмотров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланирован</Name>
					<Comment>Запланирован</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласился</Name>
					<Comment>Согласился</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НапомнитьПозже</Name>
					<Comment>Напомнить позже</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказался</Name>
					<Comment>Отказался</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/РольПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РольПользователя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Управляющий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйВрач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Врач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ассистент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регистратура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СестраХозяйка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдминистраторБазыДанных</Name>
					<Comment>Администратор базы данных</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыСобытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыСобытия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеПодтверждена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтверждена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПациентОжидает</Name>
					<Comment>Для предварительной записи более не используется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНачат</Name>
					<Comment>Пациент в кресле</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемОкончен</Name>
					<Comment>Прием окончен</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНеСостоялся</Name>
					<Comment>Для предварительной записи более не используется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемОтменен</Name>
					<Comment>Прием отменен</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/Событие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Событие</Name>
			<Comment>Предварительная запись клиента</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНапоминанияДоЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДиалога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиЗаписей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеРезерва</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеренесённаяПредварительнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолисМедСтрахования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПолисыМедицинскогоСтрахования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСобытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПациента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаРезерва</Name>
					<Comment>Цвет фона резерва</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаВремени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакЗаблокированно</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаЗаписи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныЗаписи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/Профосмотры/Forms/ФормаРедактированияЗаписиПлана/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик создания формы на сервере
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Если Параметры.Свойство("Ключ") И Не ЗначениеЗаполнено(Параметры.Ключ) Тогда
		
		Параметры.Свойство("Контрагент"         , Запись.Контрагент);
		Параметры.Свойство("Сотрудник"          , Запись.Сотрудник);
		Параметры.Свойство("Прием"              , Запись.Прием);
		Параметры.Свойство("СтруктурнаяЕдиница" , Запись.СтруктурнаяЕдиница);
		Параметры.Свойство("ДатаЗапланированная", Запись.ДатаЗапланированная);	
		Параметры.Свойство("ВидОсмотра"         , Запись.ВидОсмотра);	
		Параметры.Свойство("ПричинаНаправления" , Запись.ПричинаНаправления);
		Параметры.Свойство("Комментарий" 		, Запись.Комментарий); 
		Параметры.Свойство("Специализация" 		, Запись.Специализация);
		Параметры.Свойство("Длительность" 		, Запись.Длительность);
		Параметры.Свойство("АвторЗаписи"        , Запись.АвторЗаписи);
		
	КонецЕсли;
	
	// Поле специализация, лучше не заполнять так как оно учавствует в отборе в документе прием для формирования результата лечения
	// если запись оформлена из результата лечения, то специализация будет заполнена.
	Элементы.Специализация.Видимость = ЗначениеЗаполнено(Запись.Специализация);
	
	Запись.Период              	= ТекущаяДатаСеанса(); 
	ЗапланированнаяДата         = ?(Дата(ЗапланированнаяДата) = Дата(1,1,1), Запись.ДатаЗапланированная, ЗапланированнаяДата); 
	Запись.АвторЗаписи         	= ?(НЕ ЗначениеЗаполнено(Запись.АвторЗаписи), ПараметрыСеанса.ТекущийПользователь, Запись.АвторЗаписи);
	
	УстановитьСостояниеФормы();
	УстановитьВидимостьНадписиЗапланированыхПредварительныхЗаписей();
	
КонецПроцедуры

&НаКлиенте
// Обработчик открытия формы на клиенте
//
Процедура ПриОткрытии(Отказ)

	Если Запись.ВидОсмотра = ПредопределенноеЗначение("Перечисление.ВидыОсмотров.ОчередьНаЗапись") Тогда
		Элементы.ПричинаНаправления.ТолькоПросмотр = Ложь;
		Элементы.Комментарий.ТолькоПросмотр 	   = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Перед записью на клиенте
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Запись.Статус) Тогда
		ПоказатьПредупреждение(,"Укажите статус планирования.");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Обработчик перед записью на сервере
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДатаЗапланированная = ЗапланированнаяДата;
	
КонецПроцедуры

&НаКлиенте
// Обработчик после записи на клиенте
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗАПИСЬ_В_РЕГИСТР_ПРОФОСМОТРЫ");
	
КонецПроцедуры

&НаКлиенте
// Обработчик формы записи новго объекта
//
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если ТипЗнч(НовыйОбъект.Ссылка) = Тип("ДокументСсылка.Событие") Тогда
		
		Запись.ПредварительнаяЗапись = НовыйОбъект.Ссылка;
		Если ЗначениеЗаполнено(Запись.ПредварительнаяЗапись) Тогда
			Элементы.ДекорацияПредварительнаяЗапись.Заголовок = СформироватьПредставлениеПЗ(Запись.ПредварительнаяЗапись);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// Процедура - Сохранить.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Сохранить(Команда)
	
	Если Записать() Тогда
		Оповестить("ОбновитьРабочийСтол");
		ЭтаФорма.Закрыть(Запись);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик изменения статуса
//
Процедура СтатусПриИзменении(Элемент)
	
	УстановитьСостояниеФормы();
	
КонецПроцедуры

&НаКлиенте
// Обработчик вызова формы создания предварительной записи
//
Процедура ДекорацияПредварительнаяЗаписьНажатие(Элемент)	
	
	// Если предварительная запись еще не создана откр. форму создания	
	Если НЕ ЗначениеЗаполнено(Запись.ПредварительнаяЗапись) Тогда	

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Дата"                    , Запись.ДатаЗапланированная);
		ПараметрыФормы.Вставить("Контрагент"              , Запись.Контрагент);
		ПараметрыФормы.Вставить("Сотрудник"               , Запись.Сотрудник);
		ПараметрыФормы.Вставить("СпециализацияВрача"      , Запись.Специализация);
//		ПараметрыФормы.Вставить("ПереключательПериода"    , ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.День"));
		ПараметрыФормы.Вставить("ЗакрытьПриСозданииЗаписи", Истина);
		
		ИмяФормыПланировщика = ОбщегоНазначенияКлиент.ПолучитьИмяФормыПланировщика(ПараметрыФормы, "ФормаПредварительнойЗаписи");
		ОткрытьФорму(ИмяФормыПланировщика, ПараметрыФормы,,,,, Новый ОписаниеОповещения("ДекорацияПредварительнаяЗаписьПослеНажатия", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе 
		// Если предварительная запись создана открываем форму доккумента
		ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(Запись.ПредварительнаяЗапись)); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Декорация предварительная запись после нажатия
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ДекорацияПредварительнаяЗаписьПослеНажатия(Результат, ДополнительныеПараметры) Экспорт
	
	Запись.ПредварительнаяЗапись = Результат;
	Если ЗначениеЗаполнено(Запись.ПредварительнаяЗапись) Тогда
		Элементы.ДекорацияПредварительнаяЗапись.Заголовок = СформироватьПредставлениеПЗ(Запись.ПредварительнаяЗапись); 
		Запись.ДатаЗапланированная = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Запись.ПредварительнаяЗапись, "Дата");
		Запись.Длительность = ВернутьДлительностьПредварительнойЗаписи(Запись.ПредварительнаяЗапись);	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "Нажатие"
//
Процедура ДекорацияЗапланированнаяЗаписьНажатие(Элемент)	
	
	МассивНайденныхСтрок = ТаблицаЗапланированыхПредварительныхЗаписей.НайтиСтроки(Новый Структура("СтрокаКлюч", СтрЗаменить(Элемент.Имя, "Декорация_ПланируемаяПредварительнаяЗапись_", "")));
	Если МассивНайденныхСтрок.Количество() > 0 Тогда 
		ОткрытьФорму("Документ.Событие.ФормаОбъекта", Новый Структура("Ключ", МассивНайденныхСтрок[0].Ссылка), ЭтаФорма);		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ДополнительныеПроцедурыИФункции 

&НаСервереБезКонтекста
// Функция, Возвращает длительность приема.
//
Функция ВернутьДлительностьПредварительнойЗаписи(ПредварительнаяЗапись)
	
	СтруктураДлительности = Документы.Событие.ПолучитьПродолжительностьСобытия(ПредварительнаяЗапись); 
	Возврат ?(СтруктураДлительности <> Неопределено И СтруктураДлительности.Свойство("Длительность"), СтруктураДлительности.Длительность, 0);	
	
КонецФункции

&НаСервере
// Процедура установки состояния формы
//
Процедура УстановитьСостояниеФормы()
	
	Если  Запись.ВидОсмотра = Перечисления.ВидыОсмотров.Профосмотр Тогда
		ЭтаФорма.Заголовок = "Планирование профосмотра";
	ИначеЕсли  Запись.ВидОсмотра = Перечисления.ВидыОсмотров.Направление Тогда	
		ЭтаФорма.Заголовок = "Планирование направления к врачу"; 
	ИначеЕсли  Запись.ВидОсмотра = Перечисления.ВидыОсмотров.ПовторныйПрием Тогда	
		ЭтаФорма.Заголовок = "Планирование повторного приема";  		
	ИначеЕсли  Запись.ВидОсмотра = Перечисления.ВидыОсмотров.ОчередьНаЗапись Тогда	
		ЭтаФорма.Заголовок = "Планирование записи к врачу";
		Элементы.ПричинаНаправления.Заголовок = "Причина добавления";
	КонецЕсли;	
	
	Элементы.ДекорацияПредварительнаяЗапись.Доступность = Ложь;
	Элементы.ПричинаОтказа.Доступность                  = Ложь;
	Элементы.ЗапланированнаяДата.Доступность      		= Ложь;	
	Элементы.ПричинаПереноса.Доступность      			= Ложь;	
	
	Если ЗначениеЗаполнено(Запись.Статус) Тогда
		
		Элементы.ГруппаСтатус.Видимость = Истина;
		
		Если Запись.Статус = Перечисления.СтатусыПрофосмотров.Согласился Тогда
			
			Элементы.ГруппаСогласился.Видимость = Истина;
			Элементы.ГруппаНапомнить.Видимость  = Ложь;
			Элементы.ГруппаОтказа.Видимость 	= Ложь;
			
			Элементы.ДекорацияПредварительнаяЗапись.Доступность = Истина;
			
		ИначеЕсли Запись.Статус = Перечисления.СтатусыПрофосмотров.НапомнитьПозже Тогда
			
			Элементы.ГруппаСогласился.Видимость 	 = Ложь;
			Элементы.ГруппаНапомнить.Видимость  	 = Истина;
			Элементы.ГруппаОтказа.Видимость 		 = Ложь;
			
			Элементы.ЗапланированнаяДата.Доступность = Истина;	
			Элементы.ПричинаПереноса.Доступность   	 = Истина;
			
		ИначеЕсли Запись.Статус = Перечисления.СтатусыПрофосмотров.Отказался Тогда
			
			Элементы.ГруппаСогласился.Видимость = Ложь;
			Элементы.ГруппаНапомнить.Видимость  = Ложь;	
			Элементы.ГруппаОтказа.Видимость 	= Истина;
			
			Элементы.ПричинаОтказа.Доступность  = Истина; 
			
		КонецЕсли;	
		
	Иначе
		Элементы.ГруппаСтатус.Видимость = Ложь;
	КонецЕсли;
	
	Если НЕ Запись.Статус = Перечисления.СтатусыПрофосмотров.НапомнитьПозже Тогда 		
		ЗапланированнаяДата = Запись.ДатаЗапланированная;
	КонецЕсли;		

	// Установка фильтра списка истории приемов
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокИсторииПриемов, "Контрагент", Запись.Контрагент, ЗначениеЗаполнено(Запись.Контрагент),ВидСравненияКомпоновкиДанных.Равно);
	
	// Установить видимость причины направления
	// Если Запись.ВидОсмотра = Перечисления.ВидыОсмотров.Направление ИЛИ Запись.ВидОсмотра = Перечисления.ВидыОсмотров.ОчередьНаЗапись Тогда 
	//	Элементы.Комментарий.Видимость = Истина;
	// Иначе 
	//	Элементы.Комментарий.Видимость = Ложь;
	// КонецЕсли;
	
	Элементы.КонтрагентТелефон.Видимость = НЕ (ПараметрыСеанса.ТекущийПользователь.РольПользователя = Перечисления.РольПользователя.Врач);
	
КонецПроцедуры

&НаСервере
// Процедура устанавливает видимость у надписи
// с гиперсылками "Открыть" и "ДобавитьУслуги"
//
Процедура УстановитьВидимостьНадписиЗапланированыхПредварительныхЗаписей()
	
	// Почистим группу перед добавлением в нее элементов
	Индекс = 0;
	КоличествоЭлементов = Элементы.Группа_БудущаяПредварительнаяЗапись.ПодчиненныеЭлементы.Количество();	
	Пока Индекс < КоличествоЭлементов Цикл		
		ЭтаФорма.Элементы.Удалить(Элементы.Группа_БудущаяПредварительнаяЗапись.ПодчиненныеЭлементы[0]);
		Индекс = Индекс + 1;
	КонецЦикла;            
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытиеУслуги.Ссылка КАК Ссылка,
	|	СобытиеУслуги.ДатаНачала КАК Дата,
	|	"""""""" КАК СтрокаКлюч,
	|	СобытиеУслуги.Сотрудник КАК Сотрудник,
	|	СобытиеУслуги.Ссылка.Контрагент КАК Контрагент,
	|	СобытиеУслуги.Ссылка.Дата КАК ДатаДокумента
	|ИЗ
	|	Документ.Событие.Услуги КАК СобытиеУслуги
	|ГДЕ
	|	НЕ СобытиеУслуги.Ссылка.ПометкаУдаления
	|	И СобытиеУслуги.ДатаНачала >= &ДатаНачала
	|	И СобытиеУслуги.Ссылка.Контрагент = &Контрагент
	|	И СобытиеУслуги.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И СобытиеУслуги.НомерСтроки = 1
	|	И НЕ СобытиеУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПРиемОтменен)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата");
	
	// "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	Профосмотры.Период КАК ПериодКлюч,
	//|	"""" КАК СтрокаКлюч,
	//|	Профосмотры.Контрагент КАК Контрагент,
	//|	Профосмотры.Сотрудник КАК Сотрудник,
	//|	Профосмотры.ДатаЗапланированная КАК Дата
	//|ИЗ
	//|	РегистрСведений.Профосмотры КАК Профосмотры
	//|ГДЕ
	//|	Профосмотры.Контрагент = &Контрагент
	//|	И Профосмотры.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	//|	И Профосмотры.ДатаЗапланированная >= &ДатаЗапланированная
	//|	И Профосмотры.ПредварительнаяЗапись = ЗНАЧЕНИЕ(Документ.Событие.ПустаяСсылка)
	//|	И (Профосмотры.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПрофосмотров.Запланирован)
	//|			ИЛИ Профосмотры.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПрофосмотров.НапомнитьПозже))
	//|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Контрагент"        	, Запись.Контрагент);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"  , Запись.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ДатаНачала" 			, НачалоДня(ТекущаяДатаСеанса()));	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Индекс = 0;
	ТаблицаЗапланированыхПредварительныхЗаписей.Загрузить(Результат); 
	Для Каждого Планирование Из ТаблицаЗапланированыхПредварительныхЗаписей Цикл
				
		Планирование.СтрокаКлюч = Строка(Индекс);
		
		// Добавим группу   
		ЭлементГруппа                     = ЭтаФорма.Элементы.Добавить("ГруппаПредварительнойЗаписи_" + Планирование.СтрокаКлюч, Тип("ГруппаФормы"), Элементы.Группа_БудущаяПредварительнаяЗапись);
		ЭлементГруппа.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементГруппа.ОтображатьЗаголовок = Ложь;
		ЭлементГруппа.Отображение         = ОтображениеОбычнойГруппы.Нет;
		ЭлементГруппа.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;		   
		
		// добавим элементы в эту группу
		ЭлементДекорация                           = ЭтаФорма.Элементы.Добавить("Декорация_Картинка_" + Планирование.СтрокаКлюч, Тип("ДекорацияФормы"), ЭлементГруппа);
		ЭлементДекорация.Вид                       = ВидДекорацииФормы.Картинка;
		ЭлементДекорация.Картинка 				   = БиблиотекаКартинок.КалендарьДень;
		// ЭлементДекорация.ГоризонтальноеПоложение   = ГоризонтальноеПоложениеЭлемента.Лево;
		ЭлементДекорация.Ширина = 2;
		ЭлементДекорация.Высота = 1;
		// -------------------------------
		ЭлементДекорация                          = ЭтаФорма.Элементы.Добавить("Декорация_ПланируемаяПредварительнаяЗапись_" + Планирование.СтрокаКлюч, Тип("ДекорацияФормы"), ЭлементГруппа);
		ЭлементДекорация.Вид                      = ВидДекорацииФормы.Надпись;
		ЭлементДекорация.ГоризонтальноеПоложение  = ГоризонтальноеПоложениеЭлемента.Лево;
		ЭлементДекорация.Гиперссылка              = Истина;
		// ЭлементДекорация.Шрифт                    = Новый Шрифт( , , Истина, );
		ЭлементДекорация.Заголовок = Формат(Планирование.Дата, "ДФ=ddd") + ", " + Сред(Формат(Планирование.Дата, "ДЛФ=DD"), 1, ?(СтрДлина(Формат(Планирование.Дата, "ДЛФ=DD")) > 0, СтрДлина(Формат(Планирование.Дата, "ДЛФ=DD")) - 1, 0)) + ", " + Строка(Планирование.Сотрудник);
		ЭлементДекорация.УстановитьДействие("Нажатие", "ДекорацияЗапланированнаяЗаписьНажатие"); 
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезконтекста
// Сформировать представление ссылки на ПЗ
//
Функция СформироватьПредставлениеПЗ(ДокСсылка)	
	
	Если ДокСсылка.Услуги.Количество() > 0 Тогда
		Возврат "Запись на " + Формат(ДокСсылка.Услуги[0].ДатаНачала,"ДФ='dd MMMM yyyy H:mm'"); 
	Иначе
		Возврат Строка(ДокСсылка);
	КонецЕсли;
	
КонецФункции

#КонецОбласти
